#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.network.aws_api_gateway_rest_api.api: Refreshing state... [id=eh5mzxa31b]
module.policy.aws_iam_role.lambda_exec_role: Refreshing state... [id=lambda_exec]
module.logs.aws_cloudwatch_log_group.minimal_lambda_function: Refreshing state... [id=/aws/lambda/minimal_lambda_function]
module.buckets.aws_s3_bucket_object.minimal_function_object: Refreshing state... [id=helloWorldHandler.zip]
module.vpc.aws_vpc.kpinetworks_vpc: Refreshing state... [id=vpc-004b9544d0287a069]
module.policy.aws_iam_policy.lambda_logging: Refreshing state... [id=arn:aws:iam::435552912911:policy/iam_policy_lambda_logging_function]
module.network.aws_api_gateway_resource.resource: Refreshing state... [id=92o144]
module.network.aws_api_gateway_method.method: Refreshing state... [id=agm-eh5mzxa31b-92o144-GET]
module.policy.aws_lambda_permission.apigw_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.policy.aws_iam_role_policy_attachment.lambda_logs: Refreshing state... [id=lambda_exec-20210910222023809000000001]
module.functions.aws_lambda_function.minimal_lambda_function: Refreshing state... [id=minimal_lambda_function]
module.vpc.aws_subnet.private_subnet_b: Refreshing state... [id=subnet-050ac1709ec5cb3fc]
module.vpc.aws_subnet.private_subnet_a: Refreshing state... [id=subnet-06254fad976a8896b]
module.vpc.aws_security_group.kpinetworks_group: Refreshing state... [id=sg-079016f33dac97210]
module.network.aws_api_gateway_integration.integration: Refreshing state... [id=agi-eh5mzxa31b-92o144-GET]
module.sql.aws_db_subnet_group.kpinetworks: Refreshing state... [id=kpinetworks]
module.network.aws_api_gateway_deployment.example: Refreshing state... [id=4m8lgd]
module.network.aws_api_gateway_stage.example: Refreshing state... [id=ags-eh5mzxa31b-prod]
module.sql.aws_db_instance.kpinetworks_db: Refreshing state... [id=kpinetworksdb]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.buckets.data.aws_s3_bucket_object.minimal_function_zip will be read during apply
  # (config refers to values not yet known)
 <= data "aws_s3_bucket_object" "minimal_function_zip"  {
      + body                          = (known after apply)
      ~ bucket_key_enabled            = false -> (known after apply)
      + cache_control                 = (known after apply)
      + content_disposition           = (known after apply)
      + content_encoding              = (known after apply)
      + content_language              = (known after apply)
      ~ content_length                = 620 -> (known after apply)
      ~ content_type                  = "binary/octet-stream" -> (known after apply)
      ~ etag                          = "752cccacd1bb8463c07c4b9b1f99aef1" -> (known after apply)
      + expiration                    = (known after apply)
      + expires                       = (known after apply)
      ~ id                            = "kpinetwork-backend/helloWorldHandler.zip" -> (known after apply)
      ~ last_modified                 = "Thu, 23 Sep 2021 16:33:51 UTC" -> (known after apply)
      ~ metadata                      = {} -> (known after apply)
      + object_lock_legal_hold_status = (known after apply)
      + object_lock_mode              = (known after apply)
      + object_lock_retain_until_date = (known after apply)
      + server_side_encryption        = (known after apply)
      + sse_kms_key_id                = (known after apply)
      ~ storage_class                 = "STANDARD" -> (known after apply)
      ~ tags                          = {} -> (known after apply)
      + version_id                    = (known after apply)
      + website_redirect_location     = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.minimal_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "minimal_function_object" {
      ~ etag               = "752cccacd1bb8463c07c4b9b1f99aef1" -> "499c4a5c7a230724d7add462d09e7c5a"
        id                 = "helloWorldHandler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.functions.aws_lambda_function.minimal_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "minimal_lambda_function" {
        id                             = "minimal_lambda_function"
      ~ last_modified                  = "2021-09-23T16:33:52.949+0000" -> (known after apply)
      ~ source_code_hash               = "Np8gkLrK7r+5Sei9kpOmRJT8KgeSHzH11mVuvAWNqcE=" -> (known after apply)
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @kellycastrof, Action: `pull_request`*